[
  {
    "name": "BlowFish Encryptor - Secure File Encryption Platform",
    "desc": "Developed a secure web platform for encrypting and decrypting text, image, audio, and video files using the Blowfish algorithm. Implemented client-side encryption to encrypt files before upload to AWS S3, ensuring zero-data visibility in cloud storage. Integrated MySQL-based session with automated email delivery of encryption keys and secured data transmission using SSL to prevent MITM attacks.",
    "image": "blowfish",
    "category": "mern",
    "links": {
      "view": "https://github.com/apurvwaghmare/secure-file-storage",
      "code": "https://github.com/apurvwaghmare/secure-file-storage"
    }
  },
  {
    "name": "AgriRent - Equipment Rental Platform",
    "desc": "Built a full-stack agriculture equipment rental platform enabling farmers to rent machinery from verified vendors nearby. Implemented multi-role access control for Admin, Vendor, and Customer using JWT-based authentication and RBAC. Developed a real-time booking system with availability tracking, conflict prevention, and user-driven equipment ratings.",
    "image": "agrirent",
    "category": "mern",
    "links": {
      "view": "https://github.com/apurvwaghmare/AgriRent",
      "code": "https://github.com/apurvwaghmare/AgriRent"
    }
  },
  {
    "name": "Image Forgery Detection using CNNs",
    "desc": "Developed a CNN-based system using Error Level Analysis (ELA) to detect tampered images. Trained a VGG16 model on the CASIA2 dataset achieving 88% validation accuracy. Evaluated model performance using Precision, Recall, F1 score, and ROC-AUC metrics. Technologies: Python, OpenCV, VGG16",
    "image": "imageforgery",
    "category": "ml",
    "links": {
      "view": "https://github.com/apurvwaghmare/Image-Tampering-Detection",
      "code": "https://github.com/apurvwaghmare/Image-Tampering-Detection"
    }
  },
  {
    "name": "Data Structures & Algorithms Practice",
    "desc": "Solved 400+ Data Structures and Algorithms problems on LeetCode using C and C++. Strong foundation in problem-solving, optimization, and algorithmic thinking.",
    "image": "leetcode",
    "category": "others",
    "links": {
      "view": "https://leetcode.com/u/apurvwaghmare07/",
      "code": "https://leetcode.com/u/apurvwaghmare07/"
    }
  }
]
